lkolbly/cmsis-svd/data/Cypress/MB9B360L.svd
        <!-- REGISTER "IRQ003SEL" -->
        <register>
          <name>IRQ003SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ003)</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ004SEL" -->
        <register>
          <name>IRQ004SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ004)</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ005SEL" -->
        <register>
          <name>IRQ005SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ005)</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ006SEL" -->
        <register>
          <name>IRQ006SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ006)</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
