lkolbly/cmsis-svd/data/Cypress/MB9B360L.svd
        <!-- REGISTER "HWINTCLR7" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR7</name>
          <description>Hardware transfer interrupt clear Register 7</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK0" -->
        <register>
          <name>DQMSK0</name>
          <description>DMA request mask Register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSK1" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK1</name>
          <description>DMA request mask Register 1</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "DQMSK2" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK2</name>
          <description>DMA request mask Register 2</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "DQMSK3" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK3</name>
          <description>DMA request mask Register 3</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK4" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK4</name>
          <description>DMA request mask Register 4</description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "DQMSK5" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK5</name>
          <description>DMA request mask Register 5</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "DQMSK6" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK6</name>
          <description>DMA request mask Register 6</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "DQMSK7" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK7</name>
          <description>DMA request mask Register 7</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR0" -->
        <register>
          <name>DQMSKCLR0</name>
          <description>DMA request mask clear Register 0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSKCLR1" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR1</name>
          <description>DMA request mask clear Register 1</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR2" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR2</name>
          <description>DMA request mask clear Register 2</description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR3" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR3</name>
          <description>DMA request mask clear Register 3</description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR4" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR4</name>
          <description>DMA request mask clear Register 4</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR5" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR5</name>
          <description>DMA request mask clear Register 5</description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR6" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR6</name>
          <description>DMA request mask clear Register 6</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR7" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR7</name>
          <description>DMA request mask clear Register 7</description>
          <addressOffset>0xAC</addressOffset>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>